{
  "backend/main.mo": "Main backend actor implementing note management with user profiles, CRUD operations for notes with PDF blobs, access control via MixinAuthorization, and blob storage via MixinStorage. Includes query functions for filtering and sorting notes by timestamp.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: image upload with validation, Tesseract.js OCR integration, handwriting rendering engine, style customization UI, and A4 PDF generation with multi-page support.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, hooks, services, utilities, and configuration files for the Scriptify Notes application with handwriting conversion functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes using warm amber/orange palette for notebook-themed design.",
  "frontend/index.html": "HTML entry point for Scriptify Notes application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, convert, and history pages, theme provider, protected routes, and profile setup modal.",
  "frontend/src/components/ImageUpload.tsx": "Drag-and-drop image upload component with file validation for PNG/JPG up to 10MB, preview display, and proceed/reset functionality.",
  "frontend/src/components/Layout.tsx": "Application layout with header navigation (home, convert, history), login button, footer with attribution, and warm notebook-themed background with paper texture overlay.",
  "frontend/src/components/LoginButton.tsx": "A button component that toggles between login and logout states using Internet Identity, with loading states and error handling for authentication.",
  "frontend/src/components/NoteHistory.tsx": "Displays a list of saved notes with options to download or delete each note, showing loading and empty states appropriately.",
  "frontend/src/components/PDFPreview.tsx": "Previews generated handwritten note images with options to download locally or save to history with upload progress tracking.",
  "frontend/src/components/ProfileSetup.tsx": "A modal dialog that prompts authenticated users without a profile to enter their name on first login.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that shows authentication prompts for unauthenticated users and loading states during initialization.",
  "frontend/src/components/StyleCustomizer.tsx": "Allows users to customize handwriting style (ink color and paper background) and triggers PDF generation with the selected style.",
  "frontend/src/components/TextEditor.tsx": "Extracts text from uploaded images using OCR (in demo mode) and provides a textarea for users to edit the extracted text before conversion.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOCR.ts": "React hook that wraps OCR text extraction functionality with loading state, progress tracking, and error handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and notes via the backend actor, including save/delete operations with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a warm amber/orange notebook theme, handwriting fonts (Caveat, Patrick Hand, Kalam), and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/ConvertPage.tsx": "Multi-step conversion page that guides users through uploading images, extracting text via OCR, customizing handwriting style, and previewing the generated PDF.",
  "frontend/src/pages/HistoryPage.tsx": "Page displaying the user's previously converted handwritten notes with download functionality via the NoteHistory component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards explaining the conversion process, and conditional navigation based on authentication status.",
  "frontend/src/services/handwritingRenderer.ts": "Canvas-based text renderer that applies handwriting variations (rotation, spacing, baseline shifts) to simulate realistic handwritten text with configurable ink color.",
  "frontend/src/services/ocrService.ts": "Placeholder OCR service that simulates text extraction with progress updates; designed to integrate with Tesseract.js via CDN in production.",
  "frontend/src/services/pdfGenerator.ts": "Generates PDF-like documents by rendering text with handwriting variations on a canvas with configurable paper backgrounds (ruled, graph, margin) and ink colors, then exports as PNG blob.",
  "frontend/src/types/handwritingStyles.ts": "Defines the HandwritingStyle interface with inkColor ('blue' or 'black') and paperBackground ('ruled', 'graph', or 'margin') properties.",
  "frontend/src/utils/fileDownload.ts": "Provides a utility function to trigger browser downloads by creating a temporary anchor element with a blob URL.",
  "frontend/src/utils/fileValidation.ts": "Validates uploaded image files against allowed types (PNG/JPG) and a 10MB size limit, returning validation results with error messages.",
  "frontend/src/utils/handwritingVariations.ts": "Generates randomized character variations (spacing, rotation, baseline shift, stroke thickness) to simulate realistic handwriting.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended border radius, custom fonts (Caveat, Kalam), and animation keyframes for accordions.",
  "project_state.json": "Project metadata describing Scriptify Notes as a React/Motoko web app for converting screenshots to handwritten-style PDFs with OCR, sketch conversion, and Internet Identity authentication."
}